ClarePhang/cc2650_easy_link_example_BEng_Final_Project/source/apps/components/driverlib/source/pg1/aon_batmon.h
/******************************************************************************
*  Filename:       aon_batmon.h
*  Revised:        $Date: 2014-03-04 15:36:43 +0100 (ti, 04 mar 2014) $
*  Revision:       $Revision: 40299 $
*
*  Description:    Defines and prototypes for the AON Battery and Temperature
*                  Monitor
*
*  Copyright (C) 2014 Texas Instruments Incorporated - http://www.ti.com/
*
*
*  Redistribution and use in source and binary forms, with or without
*  modification, are permitted provided that the following conditions
*  are met:
*
*    Redistributions of source code must retain the above copyright
*    notice, this list of conditions and the following disclaimer.
*
*    Redistributions in binary form must reproduce the above copyright
*    notice, this list of conditions and the following disclaimer in the
*    documentation and/or other materials provided with the distribution.
*
*    Neither the name of Texas Instruments Incorporated nor the names of
*    its contributors may be used to endorse or promote products derived
*    from this software without specific prior written permission.
*
*  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
*  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
*  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
*  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
*  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
*  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
*  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
*  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
*  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
*  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
*  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

//*****************************************************************************
//
//! \addtogroup aonbatmon_api
//! @{
//
//*****************************************************************************

#ifndef __AON_BATMON_H__
#define __AON_BATMON_H__

//*****************************************************************************
//
// If building with a C++ compiler, make all of the definitions in this header
// have a C binding.
//
//*****************************************************************************
#ifdef __cplusplus
extern "C"
{
#endif

#include <stdbool.h>
#include <stdint.h>
#include "hw_types.h"
#include "hw_memmap.h"
#include "hw_aon_batmon.h"
#include "debug.h"

//*****************************************************************************
//
// Values that can be passed to the AONBatMonMeasurementCycleSet() for setting
// the measurement cycle.
//
//*****************************************************************************
#define AON_BATMON_CYCLE_32         0x00000003  // 32 Clock cycles between 
                                                // each measurement.
#define AON_BATMON_CYCLE_16         0x00000002  // 16 Clock cycles between 
                                                // each measurement.
#define AON_BATMON_CYCLE_8          0x00000001  // 8 Clock cycles between 
                                                // each measurement.
#define AON_BATMON_CYCLE_CONT       0x00000000  // Continouos measurement

//*****************************************************************************
//
// API Overview
//
//*****************************************************************************
// void AONBatMonEnable(void);
// void AONBatMonDisable(void);
// void AONBatMonMeasurementCycleSet(uint32_t ui32Cycle);
// uint32_t AONBatMonMeasurementCycleGet(void);
// void AONBatMonBatteryTrimSet(uint32_t ui32TrimP0, uint32_t ui32TrimP1);
// void AONBatMonTemperatureTrimSet(uint32_t lTrimP0, uint32_t ui32TrimP1,
//                                  uint32_t ui32TrimP2);
// uint32_t AONBatMonTemperatureGet(void);
// uint32_t AONBatMonBatteryVoltageGet(void);
// bool AONBatMonNewBatteryMeasureReady(void);
// bool AONBatMonNewTempMeasureReady(void);

//*****************************************************************************
//
// API Functions and prototypes
//
//*****************************************************************************

//*****************************************************************************
//
//! Enable the temperatur and battery monitoring
//!
//! This function will enable the measurements of the temperature and the
//! battery voltage.
//!
//! To speed up the measurement of the levels the measurement can be enabled
//! before configuring the battery and temperatur settings. When all of the
//! AON_BATMON registers are configured, the calculation of the voltage and
//! temperature values can be enabled (the measurement will now take
//! effect/propagate to other blocks).
//!
//! It is possible to enable both at the same time, after the AON_BATMON
//! registers are configured, but then the first values will be ready at a
//! later point compared to the scenario above.
//!
//! \note Temperature and battery voltage measurements are not done in
//! parallel. The measurement cycle is controlled by a hardware Finite State
//! Machine. First the temperature and then the battery voltage each taking
//! one cycle to complete. However, if the comparator measuring the battery
//! voltage detects a change on the reference value, a new measurement of the
//! battery voltage only is performed immediately after. This has no impact on
//! the cycle count.
//!
//! \return None
//
//*****************************************************************************
__STATIC_INLINE void
AONBatMonEnable(void)
{
    //
    // Enable the measurements.
    //
    HWREG(AON_BATMON_BASE + AON_BATMON_O_CTL) =
        AON_BATMON_CTL_CALC_EN |
        AON_BATMON_CTL_MEAS_EN;
}

//*****************************************************************************
//
//! Disable the temperatur and battery monitoring
//!
//! This function will disable the measurements of the temperature and the
//! battery voltage.
//!
//! \return None
//
//*****************************************************************************
__STATIC_INLINE void
AONBatMonDisable(void)
{
    //
    // Disable the measurements.
    //
    HWREG(AON_BATMON_BASE + AON_BATMON_O_CTL) = 0;
}

//*****************************************************************************
//
//! Adjust the measurement cycle for the temperature and the battery voltage
//!
//! \param ui32Cycle defines the number of clock cycles between each measurement.
//!
//! The AON battery and temperature monitor can measure continously or wait
//! a predefined number of clock cycles between each measurement. This function
//! is used to adjust the length of the measurement cycle in number of clock
//! cycles.
//!
//! The possible value for the \b ui32Cycle are \b AON_BATMON_CYCLE_32,
//! \b AON_BATMON_CYCLE_16, \b AON_BATMON_CYCLE_8 or \b AON_BATMON_CYCLE_CONT.
//!
//! \return None
//
//*****************************************************************************
__STATIC_INLINE void
AONBatMonMeasurementCycleSet(uint32_t ui32Cycle)
{
    //
    // Check the arguments.
    //
    ASSERT(ui32Cycle == AON_BATMON_CYCLE_32 ||
           ui32Cycle == AON_BATMON_CYCLE_16 ||
           ui32Cycle == AON_BATMON_CYCLE_8 ||
           ui32Cycle == AON_BATMON_CYCLE_CONT);

    //
    // Set the measurement cycle.
    //
    HWREG(AON_BATMON_BASE + AON_BATMON_O_MEASCFG) = ui32Cycle;
}

//*****************************************************************************
//
//! Get the measurement cycle for the temperature and the battery voltage.
//!
//! \return Returns the current number of clock cycles between each measurent.
//
//*****************************************************************************
__STATIC_INLINE uint32_t
AONBatMonMeasurementCycleGet(void)
{
    //
    // Return the current measurement cycle.
    //
    return (HWREG(AON_BATMON_BASE + AON_BATMON_O_MEASCFG));
}

//*****************************************************************************
//
//! Set the trim values for the battery voltage calculation
//!
//! \param ui32TrimP0 is a 6 bit trim value.
//! \param ui32TrimP1 is a 6 bit trim value.
//!
//! The trim value must be setup correctly before enabling the battery voltage
//! measurement, to ensure correct calculation and system behaviour. The
//! output from the Battery monitor measurement is a 10 bit vector with a 2 bit
//! integer part and an 8 bit fractional part in the range 0 to 3,9961 Volt.
//!
//! \verbatim
//!
//!          (352 + ui32TrimP1)    (128 + ui32TrimP0) x Vbmon
//!  Vout = ----------------- + --------------------------
//!                2^8                    2^12
//!
//! \endverbatim
//!
//! \return None
//
//*****************************************************************************
__STATIC_INLINE void
AONBatMonBatteryTrimSet(uint32_t ui32TrimP0, uint32_t ui32TrimP1)
{
    //
    // Check the arguments.
    //
    ASSERT(ui32TrimP0 <= AON_BATMON_BATMONP0_CFG_M ||
           ui32TrimP1 <= AON_BATMON_BATMONP1_CFG_M);

    //
    // Set the trim values.
    //
    HWREG(AON_BATMON_BASE + AON_BATMON_O_BATMONP0) = ui32TrimP0;
    HWREG(AON_BATMON_BASE + AON_BATMON_O_BATMONP1) = ui32TrimP1;
}

//*****************************************************************************
//
//! Set the trim values for the temperature calculation
//!
//! \param ui32TrimP0 is an 8 bit trim value.
//! \param ui32TrimP1 is a 6 bit trim value.
//! \param ui32TrimP2 is a 5 bit trim value.
//!
//! The trim value must be setup correctly before enabling the temperature
//! measurement, to ensure correct calculation and system behaviour.The
//! output from the Temperature monitor measurement is a signed 10 bit vector
//! with an 8 bit integer part and a 2 bit fractional part in the range -128 C to
//! +127,75 C with a resolution of 0,25 C.
//!
//! \verbatim
//!
//!          (-384 + ui32TrimP2)    (256 + ui32TrimP1) x Temp
//!  Vout = ------------------- + ------------------------ +
//!                2^2                    2^8
//!
//!          (64 + ui32TrimP0) x Temp^2
//!         --------------------------
//!                  2^12
//!
//! \endverbatim
//!
//! \return None
//
//*****************************************************************************
__STATIC_INLINE void
AONBatMonTemperatureTrimSet(uint32_t ui32TrimP0, uint32_t ui32TrimP1,
                            uint32_t ui32TrimP2)
{
    //
    // Check the arguments.
    //
    ASSERT(ui32TrimP0 < AON_BATMON_TEMPP0_CFG_M ||
           ui32TrimP1 < AON_BATMON_TEMPP1_CFG_M ||
           ui32TrimP2 < AON_BATMON_TEMPP2_CFG_M);

    //
    // Set the trim values
    //
    HWREG(AON_BATMON_BASE + AON_BATMON_O_TEMPP0) = ui32TrimP0;
    HWREG(AON_BATMON_BASE + AON_BATMON_O_TEMPP1) = ui32TrimP1;
    HWREG(AON_BATMON_BASE + AON_BATMON_O_TEMPP2) = ui32TrimP2;
}

//*****************************************************************************
//
//! Get the current temperature measurement
//!
//! The temperature measurements are updated every cycle as defined
//! using AONBatMonMeasurementCycleSet(). This function will return the
//! current measurement.
//!
//! \note Use the function \b AONBatMonTemperatureMeasurementReady() to test
//! for a new measurement.
//!
//! \return Returns the current value of the temperature measurement in a 
//! <int.frac> format size <8.2>.
//
//*****************************************************************************
__STATIC_INLINE uint32_t
AONBatMonTemperatureGet(void)
{
    uint32_t ui32CurrentTemp;
    
    ui32CurrentTemp = HWREG(AON_BATMON_BASE + AON_BATMON_O_TEMP);
    
    //
    // Return the current temperature measurement.
    //
    return (ui32CurrentTemp >> AON_BATMON_TEMP_FRAC_S);
}

//*****************************************************************************
//
//! Get the Battery monitor measurement
//!
//! The battery voltage measurements are updated every cycle as defined
//! using AONBatMonMeasurementCycleSet(). This function will return the
//! current measurement.
//!
//! \note Use the function \b AONBatMonBatteryMeasurementReady() to test for
//! a new measurement.
//!
//! \return Returns the current value of the battery voltage measurement in a
//! <int.frac> format size <3.8> in units of volt.
//
//*****************************************************************************
__STATIC_INLINE uint32_t
AONBatMonBatteryVoltageGet(void)
{
    uint32_t ui32CurrentBattery;
    
    ui32CurrentBattery = HWREG(AON_BATMON_BASE + AON_BATMON_O_BAT);
    
    //
    // Return the current battery voltage measurement.
    //
    return (ui32CurrentBattery >> AON_BATMON_BAT_FRAC_S);
}

//*****************************************************************************
//
//! Check if a new battery measurement is available
//!
//! Use this function to check, if a new battery measurement is ready to be
//! read out. If a new measurement is ready, the function will automatically
//! clear the status bit.
//!
//! \note It is always possible to read out the current value of the 
//! battery level using \e AONBatMonBatteryGet() but this function can be
//! used to check if the measurement has changed.
//!
//! \return Returns \b true if a new measurement is ready and \b false
//! otherwise.
//
//*****************************************************************************
__STATIC_INLINE bool
AONBatMonNewBatteryMeasureReady(void)
{
    bool bStatus;

    //
    // Check the status bit.
    //
    bStatus = HWREG(AON_BATMON_BASE + AON_BATMON_O_BATUPD) &
              AON_BATMON_BATUPD_STAT ? true : false;

    //
    // Clear status bit if set.
    //
    if(bStatus)
    {
        HWREG(AON_BATMON_BASE + AON_BATMON_O_BATUPD) = 1;
    }

    //
    // Return status.
    //
    return (bStatus);
}

//*****************************************************************************
//
//! Check if a new temperature measurement is available
//!
//! Use this function to check, if a new battery measurement is ready to be
//! read out. If a new measurement is ready, the function will automatically
//! clear the status bit.
//!
//! \note It is always possible to read out the current value of the 
//! temperature using \e AONBatMonTemperatureGet() but this function can be
//! used to check if the measurement has changed.
//!
//! \return Returns \b true if a new measurement is ready and \b false
//! otherwise.
//
//*****************************************************************************
__STATIC_INLINE bool
AONBatMonNewTempMeasureReady(void)
{
    bool bStatus;

    //
    // Check the status bit.
    //
    bStatus = HWREG(AON_BATMON_BASE + AON_BATMON_O_TEMPUPD) &
              AON_BATMON_TEMPUPD_STAT ? true : false;

    //
    // Clear status bit if set.
    //
    if(bStatus)
    {
        HWREG(AON_BATMON_BASE + AON_BATMON_O_TEMPUPD) = 1;
    }

    //
    // Return status.
    //
    return (bStatus);
}

//*****************************************************************************
//
// Mark the end of the C bindings section for C++ compilers.
//
//*****************************************************************************
#ifdef __cplusplus
}
#endif

#endif //  __AON_BATMON_H__

//*****************************************************************************
//
//! Close the Doxygen group.
//! @}
//
//*****************************************************************************
